const words = [
  "Натхнення",
  "Технологічне",
  "Ідеальне",
  "Динамічне",
  "Магнетичне",
  "Безшовне",
  "Гармонійне",
  "Продумане",
  "Структурне",
  "Збалансоване",
  "Прозоре",
  "Захопливе",
  "Автентичне",
  "Елегантне",
  "Функціональне",
  "Безпечне",
  "Масштабоване",
  "Ритмічне",
  "Персоналізоване",
  "Енергійне",
  "Витончене",
  "Оптимізоване",
  "Імпульсивне",
  "Тактильне",
  "Інформативне",
  "Органічне",
  "Революційне",
  "Відкрите",
  "Гнучкопідлаштоване",
  "Логічне",
  "Футуристичне",
  "Чутливе",
  "Безмежне",
  "Плавне",
  "Тепле",
  "Збалансоване",
  "Глибокосмислене",
  "Цілеспрямоване",
  "Сміливе",
  "Модульне",
  "Шарове",
  "Ретельне",
  "Трансформативне",
  "Шармовне",
  "Розумне",
  "Незабутнє",
  "Тонке",
  "Сміливе",
  "Чистокровне",
  "Інноваційне",
  "Реалістичне",
  "Миттєве",
  "Невимушене",
  "Земне",
  "Космічне",
  "Доступне",
  "Виважене",
  "Ретельно-вивірене",
  "Ігрове",
  "Художнє",
  "Міксоване",
  "Ультрасучасне",
  "Абстрактне",
  "Системне",
  "Заземлене",
  "Теплокольорове",
  "Чітке",
  "Безконфліктне",
  "Фірмове",
  "Контрастне",
  "Лінійне",
  "Дотикове",
  "Душевне",
  "М’яке",
  "Променисте",
  "Неочікуване",
  "Кристалеве",
  "Фантазійне",
  "Етичне",
  "Чуйне",
  "Занурююче",
  "Мінімальне",
  "Стабільне",
  "Свіжозгенероване",
  "Приємне",
];
const target = document.getElementById('typewriter');

let wordIndex = 0;
let charIndex = 0;
let isDeleting = false;

function typeEffect() {
  const currentWord = `"${words[wordIndex]}"`; // лапки включено в саме слово
  const visibleText = currentWord.substring(0, charIndex);
  target.textContent = visibleText;

  if (!isDeleting) {
    if (charIndex < currentWord.length) {
      charIndex++;
      setTimeout(typeEffect, 100);
    } else {
      isDeleting = true;
      setTimeout(typeEffect, 1500);
    }
  } else {
    if (charIndex > 0) {
      charIndex--;
      setTimeout(typeEffect, 50);
    } else {
      isDeleting = false;
      wordIndex = Math.floor(Math.random() * words.length);
      setTimeout(typeEffect, 300);
    }
  }
}

typeEffect();

